/*Задание 3. Подсчёт количества слов
Что нужно сделать
Напишите программу, которая считает количество слов в тексте, введённом пользователем. Словом считается любая последовательность символов (необязательно букв) без пробелов.

Пользователь вводит строку, состоящую из произвольных символов и пробелов. Программа должна вывести одно число — количество слов во введённой строке.

Примеры

Введите строку: 
abcd abce skjc ahdy 
Ответ: 4  
 
Введите строку: 
..33 !!@! WWW )))))))))) __ )) 
Ответ: 6 

Введите строку: 
_ 
(много пробелов, затем один знак _ и ещё много пробелов) 
Ответ: 1 

Введите строку: 

 
(несколько пробелов и больше ничего) 
Ответ: 0 

Замечание. Если вводить строку обычным способом с помощью команды std::cin >> s, то С++ проигнорирует все символы после первого пробела (потому что пробел по умолчанию считается концом вводимой строки).
Чтобы ввести строку с пробелами, нужно вместо команды std::cin >> s использовать команду std::getline(std::cin, s). 

Что оценивается
Программа корректно считает любое количество символов — от 0 до 100.
Корректно обрабатывается пустая строка.*/

#include <iostream>
#include <string>

int main() {

	std::string inputText;
	std::cout << "Enter string: ";
	std::getline(std::cin, inputText);
		
	int numberWords = 0;

	if (inputText[0] != ' ') {
		numberWords++;
	}
	
	for (int i = 1; i < inputText.length(); i++) {
		if (inputText[i-1] == ' ' && inputText[i] != ' ') {
			numberWords++;
		}
		
	}
	std::cout << "Answer: " << numberWords;
}